In [1]:
import numpy as np 
import pandas as pd

In [3]:
dict1={'names':['ramesh','suresh',np.nan,'mahesh'],
      "age":[31,32,33,np.nan],
      'city':[np.nan,'hyd','mumbai','chennai']}

In [6]:
data1=pd.DataFrame(dict1)
data1

    names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2     NaN  33.0   mumbai
3  mahesh   NaN  chennai

In [10]:
data1.isnull()

   names    age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [9]:
data1.isnull().sum()   # every column has one missing value is there

names    1
age      1
city     1
dtype: int64

In [11]:
data1.isnull().sum()/len(data1)

names    0.25
age      0.25
city     0.25
dtype: float64

In [12]:
data1.isnull().sum()*100/len(data1)

names    25.0
age      25.0
city     25.0
dtype: float64

In [18]:
dict2={'names':['ramesh','suresh',None,'mahesh'],
      "age":[31,32,33,None],
      'city':[None,'hyd','mumbai','chennai']}
data2=pd.DataFrame(dict2)
data2

    names   age     city
0  ramesh  31.0     None
1  suresh  32.0      hyd
2    None  33.0   mumbai
3  mahesh   NaN  chennai

In [17]:
data2.isnull()

   names    age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [19]:
data2.isnull().sum()

names    1
age      1
city     1
dtype: int64

In [20]:
dict3={'names':['ramesh','suresh','Null','mahesh'],
      "age":[31,32,33,"Null"],
      'city':['Null','hyd','mumbai','chennai']}
data3=pd.DataFrame(dict3)
data3

    names   age     city
0  ramesh    31     Null
1  suresh    32      hyd
2    Null    33   mumbai
3  mahesh  Null  chennai

In [21]:
data3.isnull()

   names    age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

**Method-1**
- fill the missing values with random number 
- dataframe name =data1
- method name :fillna

In [22]:
data1.fillna(40)

    names   age     city
0  ramesh  31.0       40
1  suresh  32.0      hyd
2      40  33.0   mumbai
3  mahesh  40.0  chennai

**method-2**
- fill the missing values with random number on specific column
- dataframe name =data1
- method name :fillna

In [23]:
data1['names'].fillna('satish',inplace=True)
data1

    names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2  satish  33.0   mumbai
3  mahesh   NaN  chennai

In [24]:
# read the data again 
# crate the data again 
dict1={'names':['ramesh','suresh',np.nan,'mahesh'],
      "age":[31,32,33,np.nan],
      'city':[np.nan,'hyd','mumbai','chennai']}
data1=pd.DataFrame(dict1)

**method-3**
- bfill
- ffill
- pad
- backfill

In [25]:
data1.fillna(method='backfill')
# names index 2 is missed value 
#      it will replace by index 3 value 
# age index 3 is missed value 
#   we dont have index 4,so the value is Nan
# city index 0 as missed value 
#      it repalce with index 1 value

    names   age     city
0  ramesh  31.0      hyd
1  suresh  32.0      hyd
2  mahesh  33.0   mumbai
3  mahesh   NaN  chennai

In [27]:
data2.fillna(method='bfill')

    names   age     city
0  ramesh  31.0      hyd
1  suresh  32.0      hyd
2  mahesh  33.0   mumbai
3  mahesh   NaN  chennai

In [29]:
data2.fillna(method='ffill')

    names   age     city
0  ramesh  31.0     None
1  suresh  32.0      hyd
2  suresh  33.0   mumbai
3  mahesh  33.0  chennai

In [30]:
data2.fillna(method='pad')

    names   age     city
0  ramesh  31.0     None
1  suresh  32.0      hyd
2  suresh  33.0   mumbai
3  mahesh  33.0  chennai

- bfill and backfill both are same 
- pad and ffill both are same

**method-4**
- mean 
- medium 
- mode

In [31]:
age_mean=data1['age'].mean()
age_mean

32.0

In [33]:
data1['age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: age, dtype: float64

In [ ]:
# instead of providing a random number 
# we are filling witnm mean ofthe data

In [37]:
age_median= data1['age'].median()
age_median
data1['age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: age, dtype: float64

In [ ]:
# level1  : Mean Medianb valie
# level:bfill fill 
# level- 3

###  method-5 knn imputer

In [43]:
from sklearn.impute import KNNImputer 
Knn=KNNImputer(n_neighbors=2)
Knn.fit_transform (data1[['age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [44]:
data1

    names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2     NaN  33.0   mumbai
3  mahesh   NaN  chennai

**method-6**
- based on other columns
- some times all above methods ill not provide good justification 
- at that time we need to check other columns dependancy aslo
- most of the time will piclk a column which have highest correlation